Repository: Milvasoft/MilvaTemplate
Catalog: Content/MilvaTemplate.Localization/Resources/SharedResource.*.resx
Languages: tr_tr

# AccountTimeOut
source: Your session has timed out.
tr_tr: Oturumunuz zaman aşımına uğradı.

# ActionDELETE
source: Deleted
tr_tr: Silindi

# ActionPOST
source: Added
tr_tr: Eklendi

# ActionPUT
source: Updated
tr_tr: Güncellendi

# AddingNewEntityWithExistsIdException
source: You cannot add data with the same data ID as the existing data ID!
tr_tr: Varolan veri kimliği ile aynı veri kimliğine sahip bir veri ekleyemezsiniz!

# AlreadyLoggedOutMessage
source: Already logged out of the system.
tr_tr: Zaten sistemden çıkış yapılmış.

# AnyEntityWasNotFound
source: No {0} could be found.
tr_tr: Herhangi bir {0} bulunamadı.

# AppStoppedSuccessfully
source: Application successfully stopped.
tr_tr: Uygulama başarıyla durduruldu.

# CannotUpdateOrDeleteDefaultRecord
source: You cannot delete or update default database records.
tr_tr: Veritabanındaki varsayılan verileri güncelleyemez veya silemezsiniz.

# ControllersSingleObjectWasNotFound
source: {0} was not found.
tr_tr: {0} bulunamadı.

# DeletingEntityWithRelationsException
source: You are trying to delete data that has a relationship.
tr_tr: Bir ilişkisi olan verileri silmeye çalışıyorsunuz.

# DeletingInvalidEntityException
source: Invalid deleting operation.
tr_tr: Geçersiz silme işlemi!

# FeatureNotImplementedException
source: This feature is not yet in use.
tr_tr: Bu özellik henüz kullanımda değil.

# FileIsTooBigMessage
source: The file size is too large. Please upload {0} MB or smaller file.
tr_tr: Dosya boyutu çok büyük. Lütfen {0} MB veya daha küçük boyutlu bir dosya yükleyin.

# FilteringErrorMessage
source: No {0} matching the search criteria was found.
tr_tr: Arama kriterlerine uygun bir {0} bulunamadı.

# Forbidden
source: You don't have permission.
tr_tr: Erişim izniniz yok.

# IdentityConcurrencyFailure
source: Concurrency failure, data has been modified.
tr_tr: Eşzamanlılık hatası, veri değiştirildi.

# IdentityDefaultError
source: An unknown failure has occurred.
tr_tr: Bilinmeyen bir hata meydana geldi.

# IdentityDuplicateEmail
source: There is another user with this email.
tr_tr: Bu email hesabına sahip başka bir kullanıcı bulunuyor.

# IdentityDuplicateRoleName
source: This role is already exist.
tr_tr: Bu rol zaten var.

# IdentityDuplicateUsername
source: There is another user with this username.
tr_tr: Bu kullanıcı adına sahip başka bir kullanıcı bulunuyor.

# IdentityInvalidEmail
source: Invalid email.
tr_tr: Geçersiz email hesabı girdiniz.

# IdentityInvalidRoleName
source: Invalid role name.
tr_tr: Geçersiz bir rol adı girdiniz.

# IdentityInvalidToken
source: Invalid credentials.
tr_tr: Geçersiz kimlik bilgisi.

# IdentityInvalidUsername
source: Invalid username.
tr_tr: Geçersiz bir kullanıcı adı girdiniz.

# IdentityLoginAlreadyAssociated
source: This user is already logged in.
tr_tr: Bu kullanıcı zaten giriş yapmış.

# IdentityPasswordMismatch
source: Incorrect password.
tr_tr: Yanlış şifre girdiniz.

# IdentityPasswordRequiresDigit
source: Password must have at least one digit.
tr_tr: Şifre en az bir rakam içermelidir.

# IdentityPasswordRequiresLower
source: Password must have at least one lowercase.
tr_tr: Şifre en az bir küçük harf içermelidir.

# IdentityPasswordRequiresNonAlphanumeric
source: Password must have at least one alphanumeric character.
tr_tr: Parola en az bir alfanümerik karakter içermelidir.

# IdentityPasswordRequiresUniqueChars
source: Password must have at least one special character.
tr_tr: Parola en az bir özel karakter içermelidir.

# IdentityPasswordRequiresUpper
source: Password must have at least one uppercase.
tr_tr: Şifre en az bir büyük harf içermelidir.

# IdentityPasswordTooShort
source: Password lenght is too short.
tr_tr: Şifre uzunluğu çok kısa.

# IdentityRecoveryCodeRedemptionFailed
source: Recovery failed.
tr_tr: Kurtarma başarısız oldu.

# IdentityResultException
source: An error occurred while performing user operations.
tr_tr: Kullanıcı işlemlerinde bir hata gerçekleşti.

# IdentityUserAlreadyHasPassword
source: User already has password.
tr_tr: Kullanıcının zaten bir şifresi var.

# IdentityUserAlreadyInRole
source: The user is already assigned to this role.
tr_tr: Kullanıcı zaten bu role atanmış.

# IdentityUserLockoutNotEnabled
source: Lockout is not enabled for this user.
tr_tr: Bu kullanıcı için kilitleme etkinleştirilmedi.

# IdentityUserNotInRole
source: User is not assigned to this role.
tr_tr: Kullanıcı bu role atanmamış.

# InvalidItemRangeException
source: Please enter a valid 'item count'.
tr_tr: Lütfen geçerli bir 'listelenecek eleman' sayısı giriniz.

# InvalidLicenceException
source: Invalid licence!
tr_tr: Geçersiz lisans!

# InvalidNumericValueException
source: The numerical value of {0} entered is an invalid value for this operation.
tr_tr: Girilen {0} sayısal değeri bu işlem için geçersiz bir değerdir.

# InvalidPageIndexException
source: Please enter a valid page number.
tr_tr: Lütfen geçerli bir sayfa numarası giriniz.

# WrongRequestedPageNumber
source: Requested page count cannot be 0. Page count must be greater than 0.
tr_tr: İstenen sayfa sayısı 0 olamaz. Sayfa sayısı 0'dan büyük olmalıdır.

# InvalidParameterException
source: An error was found in the data. Please contact Milvasoft officials.
tr_tr: Veride hata bulundu. Lütfen Milvasoft yetkilileri ile iletişime geçiniz.

# InvalidRelatedProcess
source: There is a data that is related to the data you are trying to process.
tr_tr: İşlemi yapmaya çalıştığınız verilerin ilişkili olduğu bir veri bulunmakta.

# WrongRequestedItemCount
source: Count of requested record count cannot be 0 or less. Requested record count must be greater than 0.
tr_tr: İstenen kayıt sayısının sayısı 0 veya daha az olamaz. İstenen kayıt sayısı 0'dan büyük olmalıdır.

# LocalizedName
source: Name
tr_tr: İsim

# LocalizedPassword
source: Password
tr_tr: Parola

# LocalizedUser
source: User
tr_tr: Kullanıcı

# LocalizedUserName
source: UserName
tr_tr: Kullanıcı adı

# LocalizedWebSiteAddress
source: Web site address
tr_tr: Web site adresi

# LoginCustomerErrorMessageFromAPI
source: There was a problem. Error message: {0}
tr_tr: Bir problem oluştu. Hata mesajı: {0}

# MilvaBaseException
source: An unexpected error was encountered, please try again. If the problem is not resolved, please contact Milvasoft technical team.
tr_tr: Beklenmeyen bir hata ile karşılaşıldı lütfen tekrar deneyiniz. Eğer sorun çözülmezse lütfen Milvasoft teknik ekibi ile iletişime geçiniz.

# MinDecimalValueException
source: Please enter a valid {0}.
tr_tr: Lütfen geçerli bir {0} girin.

# MissingHeaderException
source: Please enter {0} header info.
tr_tr: {0} Header bilgisini giriniz!

# DeleteErrorMessage
source: No {0} found to be deleted.
tr_tr: Silinecek herhangi bir {0} bulunamadı.

# GetAllErrorMessage
source: No {0} found.
tr_tr: Herhangi bir {0} bulunamadı.

# NullParameterException
source: You have submitted some data incomplete. If you think you haven't made a mistake, please contact the Milvasoft technical team.
tr_tr: Bazı verileri eksik gönderdiniz. Eğer bir hata yapmadığınızı düşünüyorsanız lütfen Milvasoft teknik ekibi ile iletişime geçin.

# OutOfRangePageCountMessage
source: The number of pages requested is greater than the page generated. Maximum number of pages should be {0}.
tr_tr: İstenen sayfa sayısı oluşan sayfa sayısından fazla. Maksimum sayfa sayısı {0} olmalıdır.

source: Please enter a valid value.
tr_tr: Lütfen geçerli bir değer girin.

# PreventStringInjectionBellowMin
source: {0} is below the minimum character limit. Please enter at least {1} characters.
tr_tr: {0}, minimum karakter sınırının altında. Lütfen en az {1} karakter girin.

# PreventStringInjectionContainsForbiddenWordError
source: {0} contains invalid words.
tr_tr: {0}, geçersiz kelime içeriyor.

# PreventStringInjectionLengthResultNotTrue
source: {0} must have a character length in the range {1} to {2}.
tr_tr: {0}, {1} ile {2} aralığında bir karakter uzunluğuna sahip olmalıdır.

# PreventStringInjectionMaxLengthException
source: Please enter a valid value for the maximum character length.
tr_tr: Lütfen maksimum karakter uzunluğu için geçerli bir değer girin.

# PreventStringInjectionMinLengthBigThanMaxLengthException
source: The minimum value ({0}) you entered is greater than the maximum value ({1}). Please enter a valid range of values.
tr_tr: Girdiğiniz minimum değer({0}) maksimum değerden({1}) büyük. Lütfen geçerli bir değer aralığı girin.

# PreventStringInjectionMinLengthException
source: Please enter a valid value for the minimum character length.
tr_tr: Lütfen minimum karakter uzunluğu için geçerli bir değer girin.

# ProcessCompletedSuccessfully
source: The process was successfully completed
tr_tr: İşlem başarıyla gerçekleşti.

# PropertyIsRequired
source: {0} is required.
tr_tr: {0} girilmesi zorunludur.

# RegexErrorMessage
source: {0} is not in the correct format. Please enter in this format: {1}
tr_tr: {0}, düzgün formatta değil. Lütfen şu formatta girin: {1}

# RegexExampleEmail
source: sample@milvasoft.com
tr_tr: ornek@milvasoft.com

# RegexExampleIsoCode
source: en-US
tr_tr: tr-TR

# RegexPatternAccountNo
source: ^((\d{8}))$
tr_tr: ^((\d{4})-(\d{6}))$

# RegexPatternIBANNO
source: ^((\d{2}) ([A-Z]{4}) (\d{4}) (\d{4}) (\d{4}) (\d{2}))$
tr_tr: ^((\d{2}) (\d{4}) (\d{4}) (\d{4}) (\d{4}) (\d{4}) (\d{2}))$

# RegexPatternPhoneNumber
source: ^((\d{3}) (\d{3}) (\d{4}))$
tr_tr: ^(0 (\d{3}) (\d{3}) (\d{2}) (\d{2}))$

# RolesUpdatedSuccessfully
source: User roles have been successfully updated.
tr_tr: Kullanıcı rolleri başarıyla güncellendi.

# AddSuccessMessage
source: {0} was successfully added.
tr_tr: {0} başarıyla eklendi.

# SuccessfullyLoginMessage
source: Successfully logged in.
tr_tr: Başarıyla giriş yapıldı.

# SuccessfullyLoguotMessage
source: Successfully logged out.
tr_tr: Başarıyla çıkış yapıldı.

# SuccessfullyOperationMessage
source: The operation was completed successfully.
tr_tr: İşlem başarıyla gerçekleşti.

# UpdateSuccessMessage
source: {0} was successfully updated.
tr_tr: {0} başarıyla güncellendi.

# Unauthorized
source: Access is denied due to invalid credentials.
tr_tr: Geçersiz kimlik bilgileri nedeniyle erişim engellendi.

# UnknownLoginProblemMessage
source: Could not login. An unknown problem has occurred.
tr_tr: Giriş yapılamadı. Bilinmeyen bir problem oluştu.

# UnknownLogoutProblemMessage
source: Could not logout. An unknown problem has occurred.
tr_tr: Çıkış yapılamadı. Bilinmeyen bir problem oluştu.

# UnsupportedFileTypeMessage
source: This file type is not supported. Please upload a valid file type. Supported file types: {0}.
tr_tr: Bu dosya türü desteklenmiyor. Lütfen geçerli bir dosya türü yükleyin. Desteklenen dosya türleri: {0}.

# UpdatingInvalidEntityException
source: Update failed.
tr_tr: Güncelleme işlemi başarısız.

# UserValidationEmailLength
source: Mail address can contain up to {0} characters.
tr_tr: Mail adresi en fazla {0} karakter içerebilir.

# UserValidationUserNameLength
source: UserName can contain a minimum of {0} and a maximum of {1} characters.
tr_tr: Kullanıcı adı en az {0}, en fazla {1} karakter içerebilir.

# UserValidationUserNameNumberStartWith
source: UserName cannot start with a numeric character.
tr_tr: Kullanıcı adı sayısal bir karakter ile başlayamaz.

# MilvaValidationException
source: Invalid model state. Please enter a valid model state.
tr_tr: Geçersiz model değeri. Lütfen geçerli bir model değeri giriniz.

# ValidationIdParameterGeneralError
source: Please enter all required parameters completely.
tr_tr: Lütfen gerekli olan bütün parametreleri eksiksiz girin.

# ValidationIdPropertyError
source: Please select a valid {0}.
tr_tr: Lütfen geçerli bir {0} seçin.

# WantedWasNotFound
source: The requested {0} could not be found.
tr_tr: {0} bulunamadı.

# MilvaUserFriendlyException
source: An error occurred. The error may be related to wrong parameter or url. Please check the request parameters or url.
tr_tr: Bir hata oluştu. Hata, yanlış parametre veya url ile ilgili olabilir. Lütfen istek parametrelerini veya url'yi kontrol edin

# MiddlewareGeneralErrorMessage
source: An error occurred. The error may be related to wrong parameter or url. Please check the request parameters or url.
tr_tr: Bir hata oluştu. Hata, yanlış parametre veya url ile ilgili olabilir. Lütfen istek parametrelerini veya url'yi kontrol edin.

# WrongPaginationParamsException
source: The number of pages requested is greater than the page generated. Maximum number of pages should be {0}.
tr_tr: İstenen sayfa sayısı, oluşturulan sayfa sayfasından fazla. Maksimum sayfa sayısı {0} olmalıdır.

# AddUserRolesIsNullOrEmptyListExeption
source: You must choose at least one role.
tr_tr: En az bir tane rol seçmelisiniz.

# Hours
source: {0} hours
tr_tr: {0} saat

# InvalidEmail
source: There is no user with this email address.
tr_tr: Bu mail adresine sahip kullanıcı yok.

# InvalidLogin
source: Your login information could not be verified.
tr_tr: Giriş bilgileriniz doğrulanamadı.

# InvalidPassword
source: Invalid password was entered.
tr_tr: Geçersiz şifre girildi.

# InvalidUserName
source: There is no user with this username.
tr_tr: Bu kullanıcı adına sahip kullanıcı yok.

# Locked
source: Your account has been locked due to repeated unsuccessful login attempts. Try again after {0}.
tr_tr: Art arda başarısız giriş denemesi yaptığınızdan dolayı hesabınız kilitlenmiştir. {0} sonra tekrar deneyin.

# LockWarning
source: The session will be locked after {0} invalid attempts.
tr_tr: {0} geçersiz deneme sonucunda oturum kilitlenecektir.

# Minutes
source: {0} minutes
tr_tr: {0} dakika

# NotAllowed
source: Your login appears to be blocked for some reason. If you think this is a mistake, please contact us.
tr_tr: Girişiniz herhangi bir sebepten dolayı engellenmiş gözüküyor. Bunun bir yanlışlık olduğunu düşünüyorsanız lütfen Milvasoft teknik ekibi ile iletişime geçin.

# OldVersion
source: Your app version is outdated. Please wait for the application to be updated to continue using.
tr_tr: Uygulamanızın sürümü eski. Kullanmaya devam etmek için lütfen uygulamanın güncellenmesini bekleyin.

# PleaseEnterValidUserInfo
source: Please enter valid user information.
tr_tr: Lütfen geçerli bir kullanıcı bilgisi girin.

# RequiresTwoFactor
source: Two factor verification is required.
tr_tr: İki faktörlü doğrulama gerekli.

# Seconds
source: {0} seconds
tr_tr: {0} saniye

# TokenCouldNotBeGenerated
source: The token could not be generated.
tr_tr: Token üretilemedi.

# UserRoleAddNotFoundException
source: Role not found.
tr_tr: Rol bulunamadı.

# UserRoleNotFound
source: An active role for the user was not found.
tr_tr: Kullanıcıya ait aktif bir rol bulunamadı.

# FileCannotBeEmpty
source: Please select a file to upload.
tr_tr: Lütfen yüklemek için bir dosya seçiniz.
